In [7]:
import pandas as pd
import numpy as np

In [8]:
dates = pd.date_range('20180401', periods=6)

In [9]:
dates

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06'],
              dtype='datetime64[ns]', freq='D')

In [10]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list('ABCD'))

In [11]:
df

                   A         B         C         D
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-03  0.312754  1.107653  0.056733 -1.311537
2018-04-04 -0.202630  0.088010 -0.113997  0.148461
2018-04-05  0.012821  0.389082  1.060380  0.591386
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359

In [13]:
df.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

In [14]:
df.head()

                   A         B         C         D
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-03  0.312754  1.107653  0.056733 -1.311537
2018-04-04 -0.202630  0.088010 -0.113997  0.148461
2018-04-05  0.012821  0.389082  1.060380  0.591386

In [15]:
df.tail()

                   A         B         C         D
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-03  0.312754  1.107653  0.056733 -1.311537
2018-04-04 -0.202630  0.088010 -0.113997  0.148461
2018-04-05  0.012821  0.389082  1.060380  0.591386
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359

In [16]:
df.index

DatetimeIndex(['2018-04-01', '2018-04-02', '2018-04-03', '2018-04-04',
               '2018-04-05', '2018-04-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.values

array([[ 0.60242266, -0.41156833, -0.28908965, -0.81826673],
       [ 1.15375064, -0.03372281, -0.68877716,  0.82916467],
       [ 0.31275403,  1.10765254,  0.0567335 , -1.31153729],
       [-0.20262964,  0.08801032, -0.11399705,  0.1484608 ],
       [ 0.01282068,  0.38908178,  1.06037967,  0.59138582],
       [ 0.99138404, -1.09709486, -1.2361255 , -0.51135894]])

In [18]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [19]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.478417  0.007060 -0.201813 -0.178692
std    0.537147  0.742949  0.772301  0.838914
min   -0.202630 -1.097095 -1.236125 -1.311537
25%    0.087804 -0.317107 -0.588855 -0.741540
50%    0.457588  0.027144 -0.201543 -0.181449
75%    0.894144  0.313814  0.014051  0.480655
max    1.153751  1.107653  1.060380  0.829165

In [20]:
df.count()

A    6
B    6
C    6
D    6
dtype: int64

In [21]:
df.T

   2018-04-01  2018-04-02  2018-04-03  2018-04-04  2018-04-05  2018-04-06
A    0.602423    1.153751    0.312754   -0.202630    0.012821    0.991384
B   -0.411568   -0.033723    1.107653    0.088010    0.389082   -1.097095
C   -0.289090   -0.688777    0.056733   -0.113997    1.060380   -1.236125
D   -0.818267    0.829165   -1.311537    0.148461    0.591386   -0.511359

In [22]:
df

                   A         B         C         D
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-03  0.312754  1.107653  0.056733 -1.311537
2018-04-04 -0.202630  0.088010 -0.113997  0.148461
2018-04-05  0.012821  0.389082  1.060380  0.591386
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359

In [23]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2018-04-01 -0.818267 -0.289090 -0.411568  0.602423
2018-04-02  0.829165 -0.688777 -0.033723  1.153751
2018-04-03 -1.311537  0.056733  1.107653  0.312754
2018-04-04  0.148461 -0.113997  0.088010 -0.202630
2018-04-05  0.591386  1.060380  0.389082  0.012821
2018-04-06 -0.511359 -1.236125 -1.097095  0.991384

In [24]:
df.sort_index(axis=0, ascending=False)

                   A         B         C         D
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359
2018-04-05  0.012821  0.389082  1.060380  0.591386
2018-04-04 -0.202630  0.088010 -0.113997  0.148461
2018-04-03  0.312754  1.107653  0.056733 -1.311537
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267

In [25]:
df.sort_values(by='A')

                   A         B         C         D
2018-04-04 -0.202630  0.088010 -0.113997  0.148461
2018-04-05  0.012821  0.389082  1.060380  0.591386
2018-04-03  0.312754  1.107653  0.056733 -1.311537
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359
2018-04-02  1.153751 -0.033723 -0.688777  0.829165

In [26]:
df.sort_values(by='D')

                   A         B         C         D
2018-04-03  0.312754  1.107653  0.056733 -1.311537
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359
2018-04-04 -0.202630  0.088010 -0.113997  0.148461
2018-04-05  0.012821  0.389082  1.060380  0.591386
2018-04-02  1.153751 -0.033723 -0.688777  0.829165

In [27]:
df.sort_values(by='D', ascending=False)

                   A         B         C         D
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-05  0.012821  0.389082  1.060380  0.591386
2018-04-04 -0.202630  0.088010 -0.113997  0.148461
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-03  0.312754  1.107653  0.056733 -1.311537

In [28]:
df.A

2018-04-01    0.602423
2018-04-02    1.153751
2018-04-03    0.312754
2018-04-04   -0.202630
2018-04-05    0.012821
2018-04-06    0.991384
Freq: D, Name: A, dtype: float64

In [29]:
df.D

2018-04-01   -0.818267
2018-04-02    0.829165
2018-04-03   -1.311537
2018-04-04    0.148461
2018-04-05    0.591386
2018-04-06   -0.511359
Freq: D, Name: D, dtype: float64

In [30]:
df['D']

2018-04-01   -0.818267
2018-04-02    0.829165
2018-04-03   -1.311537
2018-04-04    0.148461
2018-04-05    0.591386
2018-04-06   -0.511359
Freq: D, Name: D, dtype: float64

In [31]:
df[0:3]

                   A         B         C         D
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-03  0.312754  1.107653  0.056733 -1.311537

In [32]:
df['20180401':'20180403']

                   A         B         C         D
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-03  0.312754  1.107653  0.056733 -1.311537

In [33]:
df.loc[dates[1]]

A    1.153751
B   -0.033723
C   -0.688777
D    0.829165
Name: 2018-04-02 00:00:00, dtype: float64

In [34]:
df.iloc[0:3]

                   A         B         C         D
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-03  0.312754  1.107653  0.056733 -1.311537

In [36]:
df[['A', 'B']]

                   A         B
2018-04-01  0.602423 -0.411568
2018-04-02  1.153751 -0.033723
2018-04-03  0.312754  1.107653
2018-04-04 -0.202630  0.088010
2018-04-05  0.012821  0.389082
2018-04-06  0.991384 -1.097095

In [45]:
df.iloc[0:3]

                   A         B         C         D
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-03  0.312754  1.107653  0.056733 -1.311537

In [46]:
df.A

2018-04-01    0.602423
2018-04-02    1.153751
2018-04-03    0.312754
2018-04-04   -0.202630
2018-04-05    0.012821
2018-04-06    0.991384
Freq: D, Name: A, dtype: float64

In [47]:
df[df.A>0]

                   A         B         C         D
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-03  0.312754  1.107653  0.056733 -1.311537
2018-04-05  0.012821  0.389082  1.060380  0.591386
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359

In [48]:
df.A[df.A>0]

2018-04-01    0.602423
2018-04-02    1.153751
2018-04-03    0.312754
2018-04-05    0.012821
2018-04-06    0.991384
Name: A, dtype: float64

In [49]:
df.iat[0, 0]

0.6024226627827611

In [50]:
df[df>0]

                   A         B         C         D
2018-04-01  0.602423       NaN       NaN       NaN
2018-04-02  1.153751       NaN       NaN  0.829165
2018-04-03  0.312754  1.107653  0.056733       NaN
2018-04-04       NaN  0.088010       NaN  0.148461
2018-04-05  0.012821  0.389082  1.060380  0.591386
2018-04-06  0.991384       NaN       NaN       NaN

In [51]:
df2 = df.copy()
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267    one
2018-04-02  1.153751 -0.033723 -0.688777  0.829165    one
2018-04-03  0.312754  1.107653  0.056733 -1.311537    two
2018-04-04 -0.202630  0.088010 -0.113997  0.148461  three
2018-04-05  0.012821  0.389082  1.060380  0.591386   four
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359  three

In [53]:
df[df2['E'].isin(['one', 'three'])]

                   A         B         C         D
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267
2018-04-02  1.153751 -0.033723 -0.688777  0.829165
2018-04-04 -0.202630  0.088010 -0.113997  0.148461
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359

In [55]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=dates)
s1

2018-04-01    1
2018-04-02    2
2018-04-03    3
2018-04-04    4
2018-04-05    5
2018-04-06    6
Freq: D, dtype: int64

In [56]:
df['F'] = s1
df

                   A         B         C         D  F
2018-04-01  0.602423 -0.411568 -0.289090 -0.818267  1
2018-04-02  1.153751 -0.033723 -0.688777  0.829165  2
2018-04-03  0.312754  1.107653  0.056733 -1.311537  3
2018-04-04 -0.202630  0.088010 -0.113997  0.148461  4
2018-04-05  0.012821  0.389082  1.060380  0.591386  5
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359  6

In [57]:
df.at[dates[0], 'A'] = 0
df.iat[0, 1] = 0
df

                   A         B         C         D  F
2018-04-01  0.000000  0.000000 -0.289090 -0.818267  1
2018-04-02  1.153751 -0.033723 -0.688777  0.829165  2
2018-04-03  0.312754  1.107653  0.056733 -1.311537  3
2018-04-04 -0.202630  0.088010 -0.113997  0.148461  4
2018-04-05  0.012821  0.389082  1.060380  0.591386  5
2018-04-06  0.991384 -1.097095 -1.236125 -0.511359  6

In [58]:
df2 = df.copy()
df2[df<0] = -df
df2

                   A         B         C         D  F
2018-04-01  0.000000  0.000000  0.289090  0.818267  1
2018-04-02  1.153751  0.033723  0.688777  0.829165  2
2018-04-03  0.312754  1.107653  0.056733  1.311537  3
2018-04-04  0.202630  0.088010  0.113997  0.148461  4
2018-04-05  0.012821  0.389082  1.060380  0.591386  5
2018-04-06  0.991384  1.097095  1.236125  0.511359  6

In [61]:
df1 = df.reindex(index=dates[0:3], columns=list('AC')+['E'])
df1

                   A         C   E
2018-04-01  0.000000 -0.289090 NaN
2018-04-02  1.153751 -0.688777 NaN
2018-04-03  0.312754  0.056733 NaN

In [64]:
df1.loc[dates[0:2], 'E'] = 1
df1

                   A         C    E
2018-04-01  0.000000 -0.289090  1.0
2018-04-02  1.153751 -0.688777  1.0
2018-04-03  0.312754  0.056733  NaN

In [67]:
df1.dropna(how='any')

                   A         C    E
2018-04-01  0.000000 -0.289090  1.0
2018-04-02  1.153751 -0.688777  1.0
2018-04-03  0.312754  0.056733  NaN

In [68]:
df1.fillna(value=np.pi)

                   A         C         E
2018-04-01  0.000000 -0.289090  1.000000
2018-04-02  1.153751 -0.688777  1.000000
2018-04-03  0.312754  0.056733  3.141593

In [73]:
df1.isna()

AttributeError: 'DataFrame' object has no attribute 'isna'

In [75]:
pd.__version__

'0.20.3'